Baanaaana/esp32-irk-finder/src/main.cpp
        setInterval(refreshData, 2000);
        window.onload = refreshData;
    </script>
</head>
<body>
    <div class="container">
        <h1>ESP32 IRK Finder</h1>

        <div id="status" class="alert alert-warning">Waiting for iPhone pairing...</div>

        <div id="mac-container" class="card hidden">
            <div class="card-content">
                <label class="label">Device MAC</label>
                <div class="input-group">
                    <input id="mac" class="input" readonly value="None">
                </div>
            </div>
        </div>

        <div id="irk-formats" class="hidden">
            <div class="card">
                <div class="card-content">
                    <label class="label">Standard IRK (Hex)</label>
                    <p class="description">Original format - use for debugging</p>
                    <div class="input-group">
                        <input id="irk" class="input" readonly>
                        <button class="btn btn-black btn-copy" onclick="copyToClipboard('irk', this)">Copy</button>
                    </div>
                </div>
            </div>

            <div class="card">
                <div class="card-content">
                    <label class="label">ESPresense Format (Reversed)</label>
                    <p class="description">Use with device_id: "irk:..." in ESPresense/Home Assistant</p>
                    <div class="input-group">
                        <input id="irk-reversed" class="input" readonly>
                        <button class="btn btn-black btn-copy" onclick="copyToClipboard('irk-reversed', this)">Copy</button>
                    </div>
                </div>
            </div>

            <div class="card">
                <div class="card-content">
                    <label class="label">Base64 Format</label>
                    <p class="description">For Home Assistant Private BLE Device integration</p>
                    <div class="input-group">
                        <input id="irk-base64" class="input" readonly>
                        <button class="btn btn-black btn-copy" onclick="copyToClipboard('irk-base64', this)">Copy</button>
                    </div>
                </div>
            </div>

            <div class="card">
                <div class="card-content">
                    <label class="label">Hex Array Format</label>
                    <p class="description">For custom implementations and programming</p>
                    <div class="input-group">
                        <input id="irk-array" class="input" readonly>
                        <button class="btn btn-black btn-copy" onclick="copyToClipboard('irk-array', this)">Copy</button>
                    </div>
                </div>
            </div>
        </div>

        <div id="wifi-config-link" class="card hidden">
            <div class="card-content" style="text-align: center;">
                <p style="margin-bottom: 1rem;">You are in Access Point mode. Configure WiFi to connect to your network.</p>
                <a href="/wifi" class="btn btn-primary" style="display: inline-block; width: auto; padding: 0.625rem 2rem;">Configure WiFi</a>
            </div>
        </div>

        <div class="instructions">
            <h3>How to retrieve iPhone IRK</h3>
            <ol>
                <li>Download a BLE scanner app from the App Store:
                    <ul style="margin-top: 0.5rem; list-style-type: disc; padding-left: 1.5rem;">
                        <li><code>LightBlue</code></li>
                        <li><code>nRF Connect</code></li>
                        <li><code>Bluetooth Terminal</code></li>
                        <li><code>BLE Scanner</code></li>
                    </ul>
                </li>
                <li>Open the BLE scanner app and scan for devices</li>
                <li>Look for <code>ESP32_IRK_FINDER</code> in the device list</li>
                <li>Tap to connect</li>
                <li>When prompted for pairing, accept the request</li>
                <li>Enter passkey: <code>123456</code></li>
                <li>After successful pairing, the IRK will appear above in multiple formats</li>
            </ol>
        </div>
    </div>
</body>
</html>
)rawliteral";

// WiFi Configuration HTML page
const char wifi_html[] PROGMEM = R"rawliteral(
<!DOCTYPE HTML>
<html>
<head>
    <title>WiFi Configuration - ESP32 IRK Finder</title>
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <style>
        * { margin: 0; padding: 0; box-sizing: border-box; }
        :root {
            --background: #ffffff; --foreground: #0a0a0a;
            --card: #ffffff; --card-foreground: #0a0a0a;
            --primary: #171717; --primary-foreground: #fafafa;
            --secondary: #f5f5f5; --secondary-foreground: #171717;
            --muted: #f5f5f5; --muted-foreground: #737373;
            --destructive: #ef4444; --destructive-foreground: #fafafa;
            --border: #e5e5e5; --input: #e5e5e5;
            --ring: #171717; --radius: 0.5rem;
        }
        body {
            font-family: -apple-system, BlinkMacSystemFont, "Segoe UI", "Roboto", "Oxygen", sans-serif;
            line-height: 1.5; color: var(--foreground);
            background: linear-gradient(to bottom, #fafafa, #f5f5f5);
            min-height: 100vh; padding: 1rem;
        }
        .container { max-width: 48rem; margin: 0 auto; padding: 2rem; }
        h1 {
            font-size: 2rem; font-weight: 700; text-align: center;
            margin-bottom: 2rem;
            background: linear-gradient(to right, #171717, #404040);
            -webkit-background-clip: text;
            -webkit-text-fill-color: transparent;
            background-clip: text;
        }
        .card {
            background: var(--card);
            border-radius: var(--radius);
            border: 1px solid var(--border);
            box-shadow: 0 1px 3px 0 rgb(0 0 0 / 0.1);
            margin-bottom: 1rem;
        }
        .card-content { padding: 1.5rem; }
        .form-group { margin-bottom: 1.5rem; }
        .label {
            font-size: 0.875rem; font-weight: 600;
            color: var(--foreground); margin-bottom: 0.5rem;
            display: block;
        }
        .input, .select {
            width: 100%; padding: 0.625rem 0.875rem;
            font-size: 0.875rem;
            background: var(--background);
            border: 1px solid var(--border);
            border-radius: calc(var(--radius) - 2px);
            color: var(--foreground);
            transition: border-color 0.2s;
        }
        .input:focus, .select:focus {
            outline: none;
            border-color: var(--ring);
            box-shadow: 0 0 0 3px rgb(23 23 23 / 0.05);
        }
        .btn {
            padding: 0.625rem 1.25rem;
            font-size: 0.875rem; font-weight: 500;
            border-radius: calc(var(--radius) - 2px);
            border: 1px solid transparent;
            cursor: pointer; transition: all 0.2s;
            width: 100%;
        }
        .btn-primary {
            background: var(--primary);
            color: var(--primary-foreground);
            border-color: var(--primary);
        }
        .btn-primary:hover { background: #262626; }
        .btn-secondary {
            background: var(--secondary);
            color: var(--secondary-foreground);
            border-color: var(--border);
        }
        .btn-secondary:hover { background: #e5e5e5; }
        .alert {
            padding: 0.75rem 1rem;
            border-radius: var(--radius);
            margin-bottom: 1.5rem;
            font-size: 0.875rem;
            font-weight: 500;
        }
        .alert-info {
            background-color: #dbeafe;
            color: #1e40af;
            border: 1px solid #93c5fd;
        }
        .networks-list {
            max-height: 300px;
            overflow-y: auto;
            border: 1px solid var(--border);
            border-radius: calc(var(--radius) - 2px);
            margin-bottom: 1rem;
        }
        .network-item {
            padding: 0.75rem 1rem;
            border-bottom: 1px solid var(--border);
            cursor: pointer;
            transition: background-color 0.2s;
        }
        .network-item:hover { background-color: var(--secondary); }
        .network-item:last-child { border-bottom: none; }
        .network-ssid { font-weight: 600; }
        .network-rssi {
            font-size: 0.75rem;
            color: var(--muted-foreground);
            margin-left: 0.5rem;
        }
        .loading { text-align: center; padding: 2rem; color: var(--muted-foreground); }
        .hidden { display: none; }
        .link {
            color: var(--primary);
            text-decoration: none;
            font-size: 0.875rem;
        }
        .link:hover { text-decoration: underline; }
        .mt-2 { margin-top: 1rem; }
    </style>
    <script>
        function saveWiFi() {
            const ssid = document.getElementById('ssid').value;
            const password = document.getElementById('password').value;

            if (!ssid) {
                alert('Please enter WiFi SSID');
                return;
            }

            fetch('/api/wifi/save', {
                method: 'POST',
                headers: { 'Content-Type': 'application/json' },
                body: JSON.stringify({ ssid, password })
            })
            .then(response => response.json())
            .then(data => {
                if (data.success) {
                    alert('WiFi settings saved! ESP32 will restart and connect to the network.');
                    setTimeout(() => { window.location.href = '/'; }, 3000);
                } else {
                    alert('Failed to save WiFi settings');
                }
            });
        }

        function clearWiFi() {
            if (confirm('Clear saved WiFi credentials?')) {
                fetch('/api/wifi/clear', { method: 'POST' })
                    .then(response => response.json())
                    .then(data => {
                        alert('WiFi credentials cleared');
                        location.reload();
                    });
            }
        }
    </script>
</head>
<body>
    <div class="container">
        <h1>WiFi Configuration</h1>

