Baanaaana/esp32-irk-finder/src/main.cpp
// Setup WiFi with saved credentials or AP mode
void setupWiFi() {
    // Load saved WiFi credentials
    preferences.begin("wifi", false);
    stored_ssid = preferences.getString("ssid", "");
    stored_password = preferences.getString("password", "");
    preferences.end();

    // Try to connect if we have saved credentials
    if (stored_ssid.length() > 0) {
        Serial.println("Attempting to connect with saved WiFi credentials...");
        Serial.print("SSID: ");
        Serial.println(stored_ssid);

        WiFi.mode(WIFI_STA);
        WiFi.begin(stored_ssid.c_str(), stored_password.c_str());

        int attempts = 0;
        while (WiFi.status() != WL_CONNECTED && attempts < 40) {  // 20 seconds timeout
            delay(500);
            Serial.print(".");
            attempts++;
        }

        if (WiFi.status() == WL_CONNECTED) {
            Serial.println("\nWiFi connected!");
            Serial.print("IP address: ");
            Serial.println(WiFi.localIP());
            isAPMode = false;
            return;
        } else {
            Serial.println("\nFailed to connect with saved credentials.");
        }
    }

    // Start AP mode if no credentials or connection failed
    Serial.println("Starting AP mode for configuration...");
    WiFi.mode(WIFI_AP);
    WiFi.softAP(AP_SSID, AP_PASSWORD);
    isAPMode = true;

    // Start DNS server for captive portal
    dnsServer.start(DNS_PORT, "*", WiFi.softAPIP());

    Serial.println("\n========================================");
    Serial.println("Access Point Started!");
    Serial.print("SSID: ");
    Serial.println(AP_SSID);
    Serial.print("Password: ");
    Serial.println(AP_PASSWORD);
    Serial.print("IP address: ");
    Serial.println(WiFi.softAPIP());
    Serial.println("Connect and you'll be redirected to WiFi config");
    Serial.println("========================================\n");
}

// Setup web server
void setupWebServer() {
    server.on("/", HTTP_GET, [](AsyncWebServerRequest *request){
        // If in AP mode, always redirect to WiFi config
        if (isAPMode) {
            request->redirect("/wifi");
        } else {
            request->send_P(200, "text/html", index_html);
        }
    });

    server.on("/api/status", HTTP_GET, [](AsyncWebServerRequest *request){
        String json = "{";
        json += "\"irk\":\"" + currentIRK + "\",";
        json += "\"irkReversed\":\"" + currentIRKReversed + "\",";
        json += "\"irkBase64\":\"" + currentIRKBase64 + "\",";
        json += "\"irkArray\":\"" + currentIRKArray + "\",";
        json += "\"mac\":\"" + connectedDeviceMAC + "\",";
        json += "\"irkRetrieved\":" + String(irkRetrieved ? "true" : "false") + ",";
        json += "\"isAPMode\":" + String(isAPMode ? "true" : "false") + ",";
        json += "\"ipAddress\":\"" + (isAPMode ? WiFi.softAPIP().toString() : WiFi.localIP().toString()) + "\"";
        json += "}";
        request->send(200, "application/json", json);
    });

    // WiFi Configuration page
    server.on("/wifi", HTTP_GET, [](AsyncWebServerRequest *request){
        request->send_P(200, "text/html", wifi_html);
    });

    // Save WiFi credentials
    server.on("/api/wifi/save", HTTP_POST, [](AsyncWebServerRequest *request){}, NULL,
        [](AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total){
            DynamicJsonDocument doc(256);
            deserializeJson(doc, (char*)data);

            String ssid = doc["ssid"].as<String>();
            String password = doc["password"].as<String>();

            preferences.begin("wifi", false);
            preferences.putString("ssid", ssid);
            preferences.putString("password", password);
            preferences.end();

            String response = "{\"success\":true}";
            request->send(200, "application/json", response);

            delay(1000);
            ESP.restart();
        });

    // Clear WiFi credentials
    server.on("/api/wifi/clear", HTTP_POST, [](AsyncWebServerRequest *request){
        preferences.begin("wifi", false);
        preferences.clear();
        preferences.end();

        String response = "{\"success\":true}";
        request->send(200, "application/json", response);

        delay(1000);
        ESP.restart();
    });

    // WiFi status
    server.on("/api/wifi/status", HTTP_GET, [](AsyncWebServerRequest *request){
        String json = "{";
        json += "\"connected\":" + String(WiFi.status() == WL_CONNECTED ? "true" : "false") + ",";
        json += "\"ssid\":\"" + (WiFi.status() == WL_CONNECTED ? WiFi.SSID() : "") + "\",";
        json += "\"ip\":\"" + (isAPMode ? WiFi.softAPIP().toString() : WiFi.localIP().toString()) + "\",";
        json += "\"mode\":\"" + String(isAPMode ? "AP" : "Station") + "\"";
        json += "}";
        request->send(200, "application/json", json);
    });

    // Captive portal handler - redirect all unknown URLs to WiFi config in AP mode
    server.onNotFound([](AsyncWebServerRequest *request){
        if (isAPMode) {
            // Redirect to WiFi config page for captive portal
            request->redirect("http://192.168.4.1/wifi");
        } else {
            request->send(404, "text/plain", "Not Found");
        }
    });

    server.begin();
    Serial.println("Web server started");
}

void setup() {
    Serial.begin(115200);
    delay(1000);

    Serial.println("\n========================================");
    Serial.println("ESP32 IRK Finder - Bluedroid Version");
    Serial.println("========================================");

    // Setup LED
    pinMode(LED_PIN, OUTPUT);
    digitalWrite(LED_PIN, LOW);

    // Configure advertising
    heart_rate_adv_config.set_scan_rsp = false;
    heart_rate_adv_config.include_txpower = true;
    heart_rate_adv_config.min_interval = 0x0006;
    heart_rate_adv_config.max_interval = 0x0010;
    heart_rate_adv_config.appearance = 0x00;
    heart_rate_adv_config.manufacturer_len = 0;
    heart_rate_adv_config.p_manufacturer_data = NULL;
    heart_rate_adv_config.service_data_len = 0;
    heart_rate_adv_config.p_service_data = NULL;
    heart_rate_adv_config.service_uuid_len = sizeof(sec_service_uuid);
    heart_rate_adv_config.p_service_uuid = sec_service_uuid;
    heart_rate_adv_config.flag = (ESP_BLE_ADV_FLAG_GEN_DISC | ESP_BLE_ADV_FLAG_BREDR_NOT_SPT);

