Baanaaana/esp32-irk-finder/src/main.cpp
    heart_rate_scan_rsp_config.set_scan_rsp = true;
    heart_rate_scan_rsp_config.include_name = true;
    heart_rate_scan_rsp_config.manufacturer_len = sizeof(test_manufacturer);
    heart_rate_scan_rsp_config.p_manufacturer_data = test_manufacturer;

    heart_rate_adv_params.adv_int_min = 0x100;
    heart_rate_adv_params.adv_int_max = 0x100;
    heart_rate_adv_params.adv_type = ADV_TYPE_IND;
    heart_rate_adv_params.own_addr_type = BLE_ADDR_TYPE_RANDOM;
    heart_rate_adv_params.channel_map = ADV_CHNL_ALL;
    heart_rate_adv_params.adv_filter_policy = ADV_FILTER_ALLOW_SCAN_ANY_CON_ANY;

    // Setup WiFi
    setupWiFi();

    // Setup web server
    setupWebServer();

    // Initialize Bluetooth
    BT_Init();

    // Clear all bonded devices on startup
    delay(1000);
    remove_all_bonded_devices();

    Serial.println("\n========================================");
    Serial.println("System ready!");
    Serial.print("Web interface: http://");
    Serial.println(WiFi.localIP());
    Serial.println("BLE Device name: ESP32_IRK_FINDER");
    Serial.println("Passkey: 123456");
    Serial.println("========================================\n");
}

void loop() {
    // Process DNS requests in AP mode
    if (isAPMode) {
        dnsServer.processNextRequest();
    }

    delay(1000);

    // Check for bonded devices periodically
    static unsigned long lastCheck = 0;
    if (millis() - lastCheck > 5000) {
        lastCheck = millis();
        if (!irkRetrieved) {
            show_bonded_devices();
        }
    }
}